<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Maker Bot Print disk image.</string>
    <key>Identifier</key>
    <string>com.github.danahall.download.MakerBotPrint</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MakerBotPrint</string>
        <key>DOWNLOAD_URL</key>
        <string>https://s3.amazonaws.com/downloads-makerbot-com/installer/release/MakerBotDesktopInstaller.pkg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/MakerBot\ Print.app</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>